// 공통 캐소드 방식(공통단자에 전원 GND를 입력, 원하는 단자에 HIGH신호)
// (참고, 애노드 공통 : 공통단자에 전원 5V를 입력하고, 원하는 단자에 LOW신호를 주어서 LED를 On시킨다)
int seg[] = {2,3,4,5,6,7,8,9}; //배열로 D2~D9까지 세그먼트 연결
byte digits[10][8]=
{
	{0,0,1,1,1,1,1,1}, //0
	{0,0,0,0,0,1,1,0}, //1
	{0,1,0,1,1,0,1,1}, //2
	{0,1,0,0,1,1,1,1}, //3
	{0,1,1,0,0,1,1,0}, //4
	{0,1,1,0,1,1,0,1}, //5
	{0,1,1,1,1,1,0,1}, //6
	{0,0,0,0,0,1,1,1}, //7
	{0,1,1,1,1,1,1,1}, //8
	{0,1,1,0,1,1,1,1}, //9
};

void setup()
{
	Serial.begin(9600);
	for(int i = 0; i<8; i++)
	{
		pinMode(seg[i], OUTPUT);
	}
}

void loop()
{
	for(int i=0; i<10; i++)
	{
		for(int j=0; j<8; j++)
		{
			digitalWrite(seg[j],digits[i][j]);
		}
		Serial.println("1");
		delay(1000); //1초간 딜레이
	}
}